eMGie01/active-load/NUCLEO-L152RE (STM32)/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define temp_1_Pin GPIO_PIN_0
#define temp_1_GPIO_Port GPIOC
#define temp_3_Pin GPIO_PIN_2
#define temp_3_GPIO_Port GPIOC
#define temp_2_Pin GPIO_PIN_3
#define temp_2_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define RS_Pin GPIO_PIN_6
#define RS_GPIO_Port GPIOA
#define RES_2_Pin GPIO_PIN_7
#define RES_2_GPIO_Port GPIOA
#define CS_3_Pin GPIO_PIN_4
#define CS_3_GPIO_Port GPIOC
#define DB7_Pin GPIO_PIN_5
#define DB7_GPIO_Port GPIOC
#define CS_2_Pin GPIO_PIN_1
#define CS_2_GPIO_Port GPIOB
#define CS_1_Pin GPIO_PIN_2
#define CS_1_GPIO_Port GPIOB
#define DB6_Pin GPIO_PIN_6
#define DB6_GPIO_Port GPIOC
#define iSW_exti_Pin GPIO_PIN_7
#define iSW_exti_GPIO_Port GPIOC
#define iSW_exti_EXTI_IRQn EXTI9_5_IRQn
#define DB5_Pin GPIO_PIN_8
#define DB5_GPIO_Port GPIOC
#define DB4_Pin GPIO_PIN_9
#define DB4_GPIO_Port GPIOC
#define SD_CS_Pin GPIO_PIN_8
#define SD_CS_GPIO_Port GPIOA
#define iDT_Pin GPIO_PIN_11
#define iDT_GPIO_Port GPIOA
#define iCLK_exti_Pin GPIO_PIN_12
#define iCLK_exti_GPIO_Port GPIOA
#define iCLK_exti_EXTI_IRQn EXTI15_10_IRQn
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define WENT_Pin GPIO_PIN_15
#define WENT_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define RES_1_Pin GPIO_PIN_6
#define RES_1_GPIO_Port GPIOB
#define EN_Pin GPIO_PIN_8
#define EN_GPIO_Port GPIOB
#define RW_Pin GPIO_PIN_9
#define RW_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
